app/views/lists/index.html.erb

SELECT COUNT(*) FROM "lists" WHERE "lists"."user_id" = 2
---
	  <% unless @user.lists.empty? %>