app/views/lists/show.html.erb

SELECT COUNT(*) FROM "tasks" WHERE "tasks"."list_id" = 2
---
	<%= render 'shared/task_form' %>
	<% unless @list.tasks.empty? %>