app/views/tasks/index.html.erb

SELECT COUNT(*) FROM "tasks" WHERE "tasks"."list_id" = 7
---
	  <% unless @list.tasks.empty? %>