app/views/users/show.html.erb

      <strong>ID пользователя:</strong>  <%=@user.id %><br />
      <strong>Количество списков:</strong> <%= @user.lists.count %>
---
SELECT COUNT(*) FROM "lists" WHERE "lists"."user_id" = 1