app/controllers/lists_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
SELECT "lists".* FROM "lists" WHERE "lists"."user_id" = 1 ORDER BY lists.created_at DESC LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM "lists" WHERE "lists"."user_id" = 2
---
  def index

    if params[:user_id].nil?
    @user=current_user
    else
       @user = User.find(params[:user_id])
    end

    if @user==current_user
      @auth=true
    end

    @title ="Lists"
    @lists = @user.lists.paginate(:page => params[:page])

INSERT INTO "lists" ("created_at", "title", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["created_at", Mon, 13 Aug 2012 14:48:18 UTC +00:00], ["title", "First list"], ["updated_at", Mon, 13 Aug 2012 14:48:18 UTC +00:00], ["user_id", 1]]
---
  def create
        @list  = current_user.lists.build(params[:list])
    if @list.save

SELECT "lists".* FROM "lists" WHERE "lists"."id" = ? ORDER BY lists.created_at DESC LIMIT 1  [["id", "11"]]
DELETE FROM "lists" WHERE "lists"."id" = ?  [["id", 11]]
---
  def destroy
    @list=List.find(params[:id])
    @list.destroy