app/controllers/lists_controller.rb

  def show
    @title=params[:user_id]

    #@user=current_user#User.Find(params[:user_id])
    @list=@current_user.lists.Find(params[:list_id])
    if @list.nil?
      @title="sad"
    end
    @tasks = @list.tasks.paginate(:page => params[:page])
---
SELECT "lists".* FROM "lists" WHERE "lists"."user_id" = 1 AND "lists"."id" = ? ORDER BY lists.created_at DESC LIMIT 1  [["id", "2"]]
SELECT "tasks".* FROM "tasks" WHERE "tasks"."list_id" = 2 ORDER BY tasks.created_at DESC LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM "tasks" WHERE "tasks"."list_id" = 2