app/controllers/tasks_controller.rb

SELECT "lists".* FROM "lists" WHERE "lists"."id" = ? ORDER BY lists.created_at DESC LIMIT 1  [["id", "2"]]
INSERT INTO "tasks" ("content", "created_at", "is_done", "list_id", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?)  [["content", "ыыф"], ["created_at", Mon, 03 Sep 2012 07:07:36 UTC +00:00], ["is_done", false], ["list_id", 6], ["updated_at", Mon, 03 Sep 2012 07:07:36 UTC +00:00], ["user_id", nil]]
---
  def create

    @list= List.find(params[:list_id])
    @task=@list.tasks.create(params[:task])

SELECT "lists".* FROM "lists" WHERE "lists"."id" = ? ORDER BY lists.created_at DESC LIMIT 1  [["id", "11"]]
SELECT "users".* FROM "users" WHERE "users"."id" = 2 LIMIT 1
SELECT "tasks".* FROM "tasks" WHERE "tasks"."list_id" = 11 ORDER BY tasks.created_at DESC LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM "tasks" WHERE "tasks"."list_id" = 11
---
  def index
    @title="Tasks"

    @list = List.find(params[:list_id])

    @user=User.find(@list.user_id)

    if @user==current_user
      @auth=true
    end

    if(@list.private)
      if @auth!=true
        redirect_back_or url_for(:controller=>"lists",:action=>"index",:user_id=>@user.id)
      end
    end

    @tasks = @list.tasks.paginate(:page => params[:page])

SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = ? ORDER BY tasks.created_at DESC LIMIT 1  [["id", "10"]]
UPDATE "tasks" SET "is_done" = 't', "updated_at" = '2012-09-05 07:32:41.638826' WHERE "tasks"."id" = 10
---
  def done
    @task=Task.find(params[:task_id])
    @task.is_done=1
    @task.save

SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = ? ORDER BY tasks.created_at DESC LIMIT 1  [["id", "11"]]
UPDATE "tasks" SET "is_done" = 'f', "updated_at" = '2012-09-05 07:32:56.714280' WHERE "tasks"."id" = 11
---
  def not_done
    @task=Task.find(params[:task_id])
    @task.is_done=0
    @task.save

SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = ? ORDER BY tasks.created_at DESC LIMIT 1  [["id", "5"]]
DELETE FROM "tasks" WHERE "tasks"."id" = ?  [["id", 5]]
---
  def destroy
    @task=Task.find(params[:id])
    @task.destroy