app/controllers/users_controller.rb

  def show
    @user = User.find(params[:id])
    @title =@user.name
    @mail = @user.email
    @lists = @user.lists.paginate(:page => params[:page])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "lists".* FROM "lists" WHERE "lists"."user_id" = 1 ORDER BY lists.created_at DESC LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM "lists" WHERE "lists"."user_id" = 1

  def create
    @user = User.new(params[:user])
    if @user.save
---
INSERT INTO "users" ("created_at", "email", "encrypted_password", "name", "salt", "updated_at") VALUES (?, ?, ?, ?, ?, ?)

  def update
    @user = User.find(params[:id])
    if @user.update_attributes(params[:user])
---
SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
UPDATE "users" SET "name" = 'Андрей Skarm Сапожников', "updated_at" = '2012-08-11 08:48:24.677552' WHERE "users"."id" = 1